# NewProjectDocument Method (String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewProjectDocument Method (String)
Application Class See Also
---
New project document
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Document NewProjectDocument(
	string templateFileName
)
```

Visual Basic
---
```text
Public Overridable Function NewProjectDocument ( _
	templateFileName As String _
) As Document
```

Visual C++
---
```text
public:
virtual Document^ NewProjectDocument(
	String^ templateFileName
)
```

# ### Parameters
templateFileName
    Type: System..::..StringThe template file name.
# Remarks
This command corresponds to New->Project command in the user-interface.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'templateFileName' is nullNothingnullptra null reference (Nothing in Visual Basic) or an empty string. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If the new project document cannot be created. |

# See Also
Application Class
NewProjectDocument Overload
Autodesk.Revit.ApplicationServices Namespace